backend/app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

INSERT INTO "admins" ("username", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    # byebug
    @admin = Admin.new(admin_params)

    if @admin.save