backend/app/controllers/children_controller.rb

    def set_daycare
      @daycare = Daycare.find(params[:daycare_id])
---
SELECT "daycares".* FROM "daycares" WHERE "daycares"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]