backend/app/controllers/toddlers_controller.rb

  def index
    @toddlers = Toddler.all
---
SELECT "toddlers".* FROM "toddlers"

  def create
    @toddler = @daycare.toddlers.new(toddler_params)

    if @toddler.save
---
INSERT INTO "toddlers" ("name", "birthday", "contact", "phone", "allergy", "daycare_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @toddler.destroy
---
DELETE FROM "toddlers" WHERE "toddlers"."id" = ?  [["id", 65]]

    def set_toddler
      @toddler = Toddler.find(params[:id])
---
SELECT "toddlers".* FROM "toddlers" WHERE "toddlers"."id" = ? LIMIT ?  [["id", 73], ["LIMIT", 1]]

    def set_daycare
      @daycare = Daycare.find_by(params[:daycare_id])
---
SELECT "daycares".* FROM "daycares" WHERE (undefined) LIMIT ?  [["LIMIT", 1]]